Repository: VovaMobile/nvda-speech-history
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: tr, uk

source: Speech History Explorer
tr: Konuşma Geçmişi Gezgini
uk: Переглядач історії мовлення

source: Copy the currently selected speech history Explorer item to the clipboard, which by default will be the most recently spoken text by NVDA.
tr: Seçili olan konuşma geçmişi Gezgini öğesini panoya kopyalar, varsayılan olarak NVDA tarafından en son konuşulan metin olacaktır.
uk: Скопіювати поточний вибраний елемент історії мовлення в буфер обміну, який початково буде останнім промовленим текстом NVDA.

source: Review the previous item in NVDA's speech history.
tr: NVDA'nın konuşma geçmişindeki bir önceki öğeyi gözden geçirir.
uk: Переглянути попередній елемент в історії мовлення NVDA.

source: Review the next item in NVDA's speech history.
tr: NVDA'nın konuşma geçmişindeki bir sonraki öğeyi gözden geçirir.
uk: Переглянути наступний елемент в історії мовлення NVDA.

source: Opens a dialog showing all most recent items spoken by NVDA
tr: NVDA tarafından konuşulan en son tüm öğeleri gösteren bir iletişim kutusu açar
uk: Відкриває діалог, в якому показано всі останні елементи, вимовлені NVDA

source: &Maximum number of history entries (requires NVDA restart to take effect)
tr: Gösterilecek &maksimum giriş sayısı (etkinleştirilebilmesi için NVDA'nın yeniden başlatılması gerekir)
uk: &Максимальна кількість записів у історії (для застосування потрібно перезапустити NVDA)

source: Trim whitespace from &start when copying text
tr: Metni kopyalarken baştaki boşluklarıke&s
uk: Обрізати нерозривні пробіли на &початку тексту під час копіювання

source: Trim whitespace from &end when copying text
tr: Metni kopyalarken sondaki boşlukları k&es
uk: Обрізати нерозривні пробіли в &кінці тексту під час копіювання

source: Beep when performing actions
tr: Eylemleri gerçekleştirirken bip sesi çıkart
uk: Звуковий сигнал при виконанні дій

source: Beep left or right when no more older or newer elements are available
tr: Daha eski öğe yoksa soldan, daha yeni öğe yoksa sağdan bip sesi çıkart
uk: Звуковий сигнал ліворуч або праворуч, коли старіших або новіших елементів більше немає

source: Speech history items
tr: Konuşma geçmişi öğeleri
uk: Елементи історії мовлення

source: &Search
tr: &Ara
uk: &Пошук

source: History list
tr: Geçmiş listesi
uk: Список історії

source: &Copy item
tr: &Öğeyi kopyala
uk: &Копіювати елемент

source: Copy &all
tr: &Tümünü kopyala
uk: Копіювати &все

source: C&lean history
tr: &Geçmişi temizle
uk: О&чистити історію

source: &Refresh history
tr: Geçmişi &yenile
uk: &Оновити історію

source: C&lose
tr: &Kapat
uk: За&крити

source: Speech history Explorer
uk: Переглядач історії мовлення

source: This add-on allows you to review the most recent strings spoken by NVDA, by default using NVDA+Shift+F11 and NVDA+Shift+F12. Additionally, you can copy any spoken item to the clipboard by pressing NVDA+Control+F12 and shows a dialog of all stored spoken elements with NVDA+Alt+f12. Use the settings panel for the add-on to increase or decrease the maximum number of stored history entries, and decide whether whitespace should be trimmed from the start or end of text. Use NVDA's Input Gestures dialog to change the supplied keystrokes.
uk: Цей додаток дозволяє переглянути останні рядки, які промовляла NVDA шляхом використання комбінацій NVDA+Shift+F11 і NVDA+Shift+F12. Крім того, ви можете скопіювати будь-який промовлений елемент до буфера обміну, натиснувши NVDA+Control+F12, а також відкрити діалог всіх збережених промовлених елементів, натиснувши NVDA+Alt+f12. Скористайтеся панеллю налаштувань додатка, щоб збільшити або зменшити максимальну кількість збережених записів історії, а також вирішити, чи потрібно обрізати пробіли на початку або в кінці тексту. Скористайтеся діалогом «Жести вводу» в NVDA, щоб змінити стандартні комбінації клавіш.
